Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
/* Definitions for QuequeBattery */
osMessageQueueId_t QuequeBatteryHandle;
const osMessageQueueAttr_t QuequeBattery_attributes = {
  .name = "QuequeBattery"
};
/* Definitions for QueDs3231Time */
osMessageQueueId_t QueDs3231TimeHandle;
const osMessageQueueAttr_t QueDs3231Time_attributes = {
  .name = "QueDs3231Time"
};
/* Definitions for QueueDs3231Date */
osMessageQueueId_t QueueDs3231DateHandle;
const osMessageQueueAttr_t QueueDs3231Date_attributes = {
  .name = "QueueDs3231Date"
};
/* Definitions for QueuePV */
osMessageQueueId_t QueuePVHandle;
const osMessageQueueAttr_t QueuePV_attributes = {
  .name = "QueuePV"
};
/* Definitions for TimerBmeData */
osTimerId_t TimerBmeDataHandle;
const osTimerAttr_t TimerBmeData_attributes = {
  .name = "TimerBmeData"
};
/* Definitions for TimerBh1750Data */
osTimerId_t TimerBh1750DataHandle;
const osTimerAttr_t TimerBh1750Data_attributes = {
  .name = "TimerBh1750Data"
};
/* Definitions for TimerRTC */
osTimerId_t TimerRTCHandle;
const osTimerAttr_t TimerRTC_attributes = {
  .name = "TimerRTC"
};
/* Definitions for TimerSDCard */
osTimerId_t TimerSDCardHandle;
const osTimerAttr_t TimerSDCard_attributes = {
  .name = "TimerSDCard"
};
/* Definitions for TimerINA219 */
osTimerId_t TimerINA219Handle;
const osTimerAttr_t TimerINA219_attributes = {
  .name = "TimerINA219"
};
/* Definitions for TimerINA219Bat */
osTimerId_t TimerINA219BatHandle;
const osTimerAttr_t TimerINA219Bat_attributes = {
  .name = "TimerINA219Bat"
};
/* Definitions for MutexPrintf */
osMutexId_t MutexPrintfHandle;
const osMutexAttr_t MutexPrintf_attributes = {
  .name = "MutexPrintf"
};
/* Definitions for MutexI2C */
osMutexId_t MutexI2CHandle;
const osMutexAttr_t MutexI2C_attributes = {
  .name = "MutexI2C"
};
/* Definitions for MutexRTC */
osMutexId_t MutexRTCHandle;
const osMutexAttr_t MutexRTC_attributes = {
  .name = "MutexRTC"
};
/* Definitions for MutexAlarm */
osMutexId_t MutexAlarmHandle;
const osMutexAttr_t MutexAlarm_attributes = {
  .name = "MutexAlarm"
};
/* Definitions for MutexI2C2 */
osMutexId_t MutexI2C2Handle;
const osMutexAttr_t MutexI2C2_attributes = {
  .name = "MutexI2C2"
};
/* Definitions for MutexSdCard */
osMutexId_t MutexSdCardHandle;
const osMutexAttr_t MutexSdCard_attributes = {
  .name = "MutexSdCard"
};
/* Definitions for BinarySemBme280 */
osSemaphoreId_t BinarySemBme280Handle;
const osSemaphoreAttr_t BinarySemBme280_attributes = {
  .name = "BinarySemBme280"
};
/* Definitions for BinarySemBH1750 */
osSemaphoreId_t BinarySemBH1750Handle;
const osSemaphoreAttr_t BinarySemBH1750_attributes = {
  .name = "BinarySemBH1750"
};
/* Definitions for BinarySemRTC */
osSemaphoreId_t BinarySemRTCHandle;
const osSemaphoreAttr_t BinarySemRTC_attributes = {
  .name = "BinarySemRTC"
};
/* Definitions for BinarySemCounter */
osSemaphoreId_t BinarySemCounterHandle;
const osSemaphoreAttr_t BinarySemCounter_attributes = {
  .name = "BinarySemCounter"
};
/* Definitions for BinarySemSetAlarm */
osSemaphoreId_t BinarySemSetAlarmHandle;
const osSemaphoreAttr_t BinarySemSetAlarm_attributes = {
  .name = "BinarySemSetAlarm"
};
/* Definitions for BinarySdCard */
osSemaphoreId_t BinarySdCardHandle;
const osSemaphoreAttr_t BinarySdCard_attributes = {
  .name = "BinarySdCard"
};
/* Definitions for BinarySemINA219 */
osSemaphoreId_t BinarySemINA219Handle;
const osSemaphoreAttr_t BinarySemINA219_attributes = {
  .name = "BinarySemINA219"
};
/* Definitions for BinaryDs3231 */
osSemaphoreId_t BinaryDs3231Handle;
const osSemaphoreAttr_t BinaryDs3231_attributes = {
  .name = "BinaryDs3231"
};
/* Definitions for BinarySemIna219Bat */
osSemaphoreId_t BinarySemIna219BatHandle;
const osSemaphoreAttr_t BinarySemIna219Bat_attributes = {
  .name = "BinarySemIna219Bat"
};

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN FunctionPrototypes */

void _putchar(char character);

/* USER CODE END FunctionPrototypes */

void StartTaskRTC(void *argument);
void StartTaskBme280(void *argument);
void StartTaskBH1750(void *argument);
void StartTaskSSD1306(void *argument);
void StartTaskPumpON(void *argument);
void StartTaskPumpOFF(void *argument);
void StartTaskCounterPump(void *argument);
void StartTaskAlarmCounter(void *argument);
void StartTaskSdCard(void *argument);
void StartTaskINA219(void *argument);
void StartTaskINA219PV(void *argument);
void StartTaskDS3231(void *argument);
void CallbackTimerBmeData(void *argument);
void CallbackTimerBh1750Data(void *argument);
void CallbackTimerRTC(void *argument);
void CallbackTimerSDCard(void *argument);
void CallbackTimerINA219(void *argument);
void CallbackTimerINA219Bat(void *argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/* Hook prototypes */
void vApplicationMallocFailedHook(void);

/* USER CODE BEGIN 5 */
void vApplicationMallocFailedHook(void)
{
   /* vApplicationMallocFailedHook() will only be called if
   configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h. It is a hook
   function that will get called if a call to pvPortMalloc() fails.
   pvPortMalloc() is called internally by the kernel whenever a task, queue,
   timer or semaphore is created. It is also called by various parts of the
   demo application. If heap_1.c or heap_2.c are used, then the size of the
   heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
   FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
   to query the size of free heap space that remains (although it does not
   provide information on how the remaining heap might be fragmented). */
}
/* USER CODE END 5 */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */
  /* Create the mutex(es) */
  /* creation of MutexPrintf */
  MutexPrintfHandle = osMutexNew(&MutexPrintf_attributes);

