Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	 	 RTC_AlarmTypeDef _AlarmON, _AlarmOFF = {0};


	 	static uint8_t _PumpDispensing = 1;
	 	static uint8_t _AlarmPeriod = 1;
	 	uint8_t SdCard = 1;






	 	 _AlarmON.AlarmTime.Hours = 8 ;
	 	 _AlarmON.AlarmTime.Minutes = 0 ;
	 	_AlarmON.AlarmTime.Seconds = 0 ;


		 _AlarmOFF.AlarmTime.Hours = 8 ;
		 _AlarmOFF.AlarmTime.Minutes = 1 ;
		_AlarmOFF.AlarmTime.Seconds = 0 ;



		osThreadFlagsSet(TaskDS3231Handle, 0x00000100U);
	 	HAL_RTC_Init(&hrtc);

//		HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
//		HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

//		HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
//		HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);


	// 	_RTCTime.Hours = 0x0;
	//    _RTCTime.Minutes =0x0;
	//	_RTCTime.Seconds =0x0;

		osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
	 	osTimerStart(TimerRTCHandle, 300);
	 	uint32_t tick4 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  //	  osMessageQueuePut(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 10);
	  //	  osMessageQueuePut(QueueAlarmHandle, &_AlarmPeriod, 0, 10);

	      printf("Task RTC start \n\r ");
	      if(osOK== osMessageQueueGet(QueDs3231TimeHandle, &_RTCTime, 0, 50))
	      {
	    	  HAL_RTC_SetTime(&hrtc,&_RTCTime, RTC_FORMAT_BIN);
	    	  if (_RTCTime.Hours  <=22)
				  {  	  _AlarmON.AlarmTime.Hours = _RTCTime.Hours + 1  ;
						 _AlarmON.AlarmTime.Minutes = 0;
						_AlarmON.AlarmTime.Seconds = 0 ;

						 _AlarmOFF.AlarmTime.Hours = _RTCTime.Hours + 1 ;
						 _AlarmOFF.AlarmTime.Minutes = 1 ;
						 _AlarmOFF.AlarmTime.Seconds = 0 ;
				  }
	    	  else
				  {
					  _AlarmON.AlarmTime.Hours = 8 	;
					  _AlarmON.AlarmTime.Minutes = 0;
					  _AlarmON.AlarmTime.Seconds = 0 ;
					  _AlarmOFF.AlarmTime.Hours = 8 ;
					 _AlarmOFF.AlarmTime.Minutes = 1 ;
					 _AlarmOFF.AlarmTime.Seconds = 0 ;
				  }
	    	  HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
	    	  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);

	    	  HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

	      }
	      else if(osOK == osMessageQueueGet(QueueDs3231DateHandle, &_RTCDate, 0, 50))
	      {
	    	  HAL_RTC_SetDate(&hrtc,&_RTCDate, RTC_FORMAT_BIN);
	    	  HAL_RTC_GetDate(&hrtc,&_RTCDate, RTC_FORMAT_BIN);
	      }
	      else
	      {
	    	  HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
	    	  HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);
	      }






	  	if (osOK == osSemaphoreAcquire(BinarySemCounterHandle, 0))
	  	{
	  		osMessageQueueGet(QueueCounterPumpHandle, &config, 0, osWaitForever);
//	  		_AlarmOFF.AlarmTime.Minutes = _PumpDispensing;

	  	}
//	  	else if (osOK == osSemaphoreAcquire(BinarySemSetAlarmHandle, 0))
//	  	{
//	  		osMessageQueueGet(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
////	  			  		_AlarmOFF.AlarmTime.Minutes = _AlarmPeriod;
//	  	}


	  ////	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 10);
	  //	  if(osOK == osSemaphoreAcquire(BinarySemSetAlarmHandle, 0))
	  //		{
	  //
	  //		  	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 100);
	  //		  	  osMessageQueueGet(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 100);
	  //			  _AlarmOFF.AlarmTime.Minutes = _PumpOperatingTime.Minutes;
	  //			  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);
	  //		}



	  	   if (_AlarmON.AlarmTime.Hours ==  _RTCTime.Hours && _AlarmON.AlarmTime.Minutes ==  _RTCTime.Minutes )
	  	  	  {
	  		      osMutexAcquire(MutexAlarmHandle, osWaitForever);
	  			  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,GPIO_PIN_SET);
	  			  osThreadFlagsSet(TaskPumpONHandle, 0x00000001U);
	  			  _AlarmON.AlarmTime.Hours = _AlarmON.AlarmTime.Hours + config.AlarmFreq;

	  			  if(_AlarmON.AlarmTime.Hours >= 22 || _AlarmON.AlarmTime.Hours <= 8)
	  				  {
	  					  _AlarmON.AlarmTime.Hours = 8;
	  				  }
	  			  HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
	  			  osMutexRelease(MutexAlarmHandle);
	  	  	  }
	  	  else if(_AlarmOFF.AlarmTime.Hours ==  _RTCTime.Hours && _AlarmOFF.AlarmTime.Minutes ==  _RTCTime.Minutes )
	  	  	  {
	  		  	  osMutexAcquire(MutexAlarmHandle, osWaitForever);
	  			  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,GPIO_PIN_RESET);
	  			  osThreadFlagsSet(TaskPumpOFFHandle, 0x00000010U);

	  			  _AlarmOFF.AlarmTime.Hours = _AlarmOFF.AlarmTime.Hours + config.AlarmFreq;

	  			if(_AlarmOFF.AlarmTime.Hours >= 22 || _AlarmOFF.AlarmTime.Hours <= 8)
	  			  	 {
	  			  		  _AlarmOFF.AlarmTime.Hours = 8;
	  			  	 }

	  			  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);
	  			  osMutexRelease(MutexAlarmHandle);

	  	  	  }
	  	  else if (_RTCTime.Hours == 23 && _RTCTime.Minutes == 59)
	  	  {
	  		osThreadFlagsSet(TaskDS3231Handle, 0x00000100U);
	  	  }



	  //	  if(RTCTime.Seconds != CompareSeconds)
	  //	  {
	  //
	  //
	  //		  CompareSeconds = RTCTime.Seconds;
	  //	  }
	  	  if (osOK == osSemaphoreAcquire(BinarySemRTCHandle, 0)) {
	  //	  	  			osMessageQueuePut(QueueRTCDataHandle, &_RTCDate, 0, osWaitForever);
	  	  	  			osMessageQueuePut(QueueRTCTimeHandle, &_RTCTime, 0, osWaitForever);
	  	  	  			osMessageQueuePut(QueueRTCDataHandle, &_RTCDate, 0, osWaitForever);
	  	  	  		}



	  	  printf("Task RTC exit \n\r ");
	  	  tick4 += ((220 * osKernelGetTickFreq()) / 1000);
	  	  osDelayUntil(tick4);

  }
  /* USER CODE END StartTaskRTC */
}

/* USER CODE BEGIN Header_StartTaskBme280 */
/**
* @brief Function implementing the TaskBme280 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskBme280 */
void StartTaskBme280(void *argument)
{
  /* USER CODE BEGIN StartTaskBme280 */
	BmeData_t _BmeData;
		uint32_t tick3;
		osMutexAcquire(MutexI2CHandle, osWaitForever);
		BME280_Init(&hi2c1, BME280_TEMPERATURE_16BIT, BME280_PRESSURE_ULTRALOWPOWER,
		BME280_HUMINIDITY_STANDARD, BME280_NORMALMODE);
		osDelay(100);
		BME280_SetConfig(BME280_STANDBY_MS_10, BME280_FILTER_OFF);
		osMutexRelease(MutexI2CHandle);
		osTimerStart(TimerBmeDataHandle, 400);

		tick3 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {

