Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  printf("TASK BME280 start\n\r ");
	  	  BME280_ReadTemperatureAndPressureAndHuminidity(&_BmeData.Temperature,
	  	  				&_BmeData.Pressure, &_BmeData.Humidity);
	  	printf("TASK BME280 exit\n\r ");
	  	  osMutexRelease(MutexI2CHandle);

	  	  if (osOK == osSemaphoreAcquire(BinarySemBme280Handle, 0)) {
	  	  			osMessageQueuePut(QueueBmeHandle, &_BmeData, 0, osWaitForever);
	  	  		}

	  //	  printf("Temperature: %.2f, Humidity: %.2f z \n\r", _BmeData.Temperature, _BmeData.Humidity);
	  //////    osDelay(100);
	  		tick3 += (335 * osKernelGetTickFreq()) / 1000;
	  		osDelayUntil(tick3);
  }
  /* USER CODE END StartTaskBme280 */
}

/* USER CODE BEGIN Header_StartTaskBH1750 */
/**
* @brief Function implementing the TaskBH1750 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskBH1750 */
void StartTaskBH1750(void *argument)
{
  /* USER CODE BEGIN StartTaskBH1750 */
		uint32_t tick4;
		BHData_t _BHData;

		//	float BH1750_lux;

		osMutexAcquire(MutexI2CHandle, osWaitForever);
		BH1750_Init(&hi2c1);
		BH1750_SetMode(CONTINUOUS_HIGH_RES_MODE_2);
		osMutexRelease(MutexI2CHandle);

		osTimerStart(TimerBh1750DataHandle, 500);
		tick4 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {

	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  printf("TASK BH1750 start \n\r ");
	 	  		BH1750_ReadLight(&_BHData.LightIntensity);
	 	  //	  	  printf("Light: %.2f \n\r", _BhData.LightIntensity);
	 	  		printf("TASK BH1750 exit \n\r ");
	 	  		osMutexRelease(MutexI2CHandle);

	 	  		if (osOK == osSemaphoreAcquire(BinarySemBH1750Handle, 0)) {
	 	  			osMessageQueuePut(QueueBh1750Handle, &_BHData, 0, osWaitForever);
	 	  		}
	 	  //	  	 	  if(BH1750_OK == BH1750_ReadLight(&BH1750_lux))
	 	  //	  	 	  	  {
	 	  //	  	 	  		  size = sprintf(buffer, "BH1750 Lux: %.2f\n\r", BH1750_lux);
	 	  //	  	 	  	  	  HAL_UART_Transmit(&huart2, (uint8_t*)buffer, size, 100);
	 	  //	  	 	  	  }

	 	  		tick4 += ((325 * osKernelGetTickFreq()) / 1000);
	 	  		osDelayUntil(tick4);
  }
  /* USER CODE END StartTaskBH1750 */
}

/* USER CODE BEGIN Header_StartTaskSSD1306 */
/**
* @brief Function implementing the TaskSSD1306 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskSSD1306 */
void StartTaskSSD1306(void *argument)
{
  /* USER CODE BEGIN StartTaskSSD1306 */
       Data_Structure_t _DataStructure;
        CONFIG_MANAGER _config
	   = {
	   	         .CurrentConfig = CONFIG_PUMP_TIME,
	   	        .PumpTime = 1,
	   	        .AlarmFreq = 1,
	   	        .TempValue = 1,
	   	        .AcceptedValue = 1
	   	    };



        SensorData_t _sensorData;



	_sensorData.RTCTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	_sensorData.RTCTime.StoreOperation = RTC_STOREOPERATION_RESET;


	uint32_t tick2;




	osMutexAcquire(MutexI2C2Handle, osWaitForever);
	SSD1306_Init(&hi2c1);
	osMutexRelease(MutexI2C2Handle);

	GFX_SetFont(font_8x5);
	SSD1306_Clear(BLACK);
	SSD1306_Display();

	osTimerStart(TimerSDCardHandle, 20000);
	tick2 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  	  SSD1306_Clear(BLACK);
	  	  UpdateDisplayMessages(&_DataStructure, &_sensorData);


	  	  SSD1306_Display();

	  	  printf("TASK OLED \n\r");

	  //		printf("TASK OLED I2C MUTEX is released \n\r");
	        tick2 += (600 * osKernelGetTickFreq()) / 1000;
	  	  osDelayUntil(tick2);
  }
  /* USER CODE END StartTaskSSD1306 */
}

/* USER CODE BEGIN Header_StartTaskPumpON */
/**
* @brief Function implementing the TaskPumpON thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpON */
void StartTaskPumpON(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpON */
	drv8835_init();
  /* Infinite loop */
  for(;;)
  {

	  osThreadFlagsWait(0x00000001U, osFlagsWaitAll, osWaitForever);

	  drv8835_set_motorA_speed(99);
	  osThreadFlagsClear(0x00000001U);
  }
  /* USER CODE END StartTaskPumpON */
}

/* USER CODE BEGIN Header_StartTaskPumpOFF */
/**
* @brief Function implementing the TaskPumpOFF thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpOFF */
void StartTaskPumpOFF(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpOFF */
  /* Infinite loop */
  for(;;)
  {
	  osThreadFlagsWait(0x00000010U, osFlagsWaitAll, osWaitForever);


	  	  drv8835_set_motorA_speed(0);

  }
  /* USER CODE END StartTaskPumpOFF */
}

/* USER CODE BEGIN Header_StartTaskCounterPump */
/**
* @brief Function implementing the TaskCounterPump thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskCounterPump */
void StartTaskCounterPump(void *argument)
{
  /* USER CODE BEGIN StartTaskCounterPump */
	static uint8_t _PumpDipensing = 1;
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
//	  if(HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin)== GPIO_PIN_RESET)
//	 	  {
//	 	  	  _PumpDipensing= _PumpDipensing + 1;
//	 	  		if(_PumpDipensing >=60)
//	 	  		{
//	 	  			_PumpDipensing = 1;
//	 	  		}
//	 	  		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 50);
//	 	  }
//	 	  else if(HAL_GPIO_ReadPin(B2_GPIO_Port, B2_Pin)== GPIO_PIN_RESET)
//	 	  {
//	 		  _PumpDipensing= _PumpDipensing -1;
//	 		 	  		if(_PumpDipensing <=0)
//	 		 	  		{
//	 		 	  			_PumpDipensing = 59;
//	 		 	  		}
//	 		   osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 50);
//	 	  }

	 	  	  	tick += (1000 * osKernelGetTickFreq()) / 1000;
	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskCounterPump */
}

/* USER CODE BEGIN Header_StartTaskAlarmCounter */
/**
* @brief Function implementing the TaskAlarmCounte thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskAlarmCounter */
void StartTaskAlarmCounter(void *argument)
{
  /* USER CODE BEGIN StartTaskAlarmCounter */
	static uint8_t _AlarmPeriod = 1;
	static CONFIG_MANAGER config
	= {
	         .CurrentConfig = CONFIG_PUMP_TIME,
	        .PumpTime = 1,
	        .AlarmFreq = 1,
	        .TempValue = 1,
	        .AcceptedValue = 1
	    };

