Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
//	TBUTTON UpButton,DownButton,Activated,Option;
//	ButtonInitKey (&UpButton,&config,UP,B1_GPIO_Port,B1_Pin,220,450,500);
//
//	ButtonInitKey (&DownButton,&config,DOWN,B2_GPIO_Port,B2_Pin,220,400,500);
//	ButtonInitKey (&Activated,&config,ACTIVATED,B3_GPIO_Port,B3_Pin,220,400,500);
//	ButtonInitKey (&UpButton,&config,OPTION,B4_GPIO_Port,B4_Pin,220,400,500);





	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
//	  ButtonTask(&UpButton,&config);
//	  ButtonTask(&DownButton,&config);
//	  ButtonTask(&Activated,&config);
//	  ButtonTask(&Option,&config);
	  	  	  if(HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin)== GPIO_PIN_RESET)
	 	 	  {
	  	  		  	 ButtonUpPressed(&config);
//	 	 	  	  _AlarmPeriod= _AlarmPeriod + 1;
//	 	 	  		if(_AlarmPeriod >=16)
//	 	 	  		{
//	 	 	  			_AlarmPeriod = 1;
//	 	 	  		}
	 	 	  		osMessageQueuePut(QueueCounterPumpHandle, &config , 0, osWaitForever);
	 	 	  }
	 	 	  else if(HAL_GPIO_ReadPin(B2_GPIO_Port, B2_Pin)== GPIO_PIN_RESET)
	 	 	  {
	 	 		  ButtonDownPressed(&config);
//	 	 		  _AlarmPeriod= _AlarmPeriod - 1;
//	 	 		 	  		if(_AlarmPeriod <=0)
//	 	 		 	  		{
//	 	 		 	  			_AlarmPeriod = 16;
//	 	 		 	  		}
	 	 		   osMessageQueuePut(QueueCounterPumpHandle, &config , 0, osWaitForever);
	 	 	  }

	 	 	 else if(HAL_GPIO_ReadPin(B3_GPIO_Port, B3_Pin)== GPIO_PIN_RESET)
	 	 		 	 	  {
	 	 		 	 		  ButtonActivatedPressed(&config);
	 	 	//	 	 		  _AlarmPeriod= _AlarmPeriod - 1;
	 	 	//	 	 		 	  		if(_AlarmPeriod <=0)
	 	 	//	 	 		 	  		{
	 	 	//	 	 		 	  			_AlarmPeriod = 16;
	 	 	//	 	 		 	  		}
	 	 		 	 		   osMessageQueuePut(QueueCounterPumpHandle, &config , 0, osWaitForever);
	 	 		 	 	  }
	 	 	 else if(HAL_GPIO_ReadPin(B4_GPIO_Port, B4_Pin)== GPIO_PIN_RESET)
	 	 		 	 	  {
	 	 		 	 		  ButtonOptionPressed(&config);
	 	 	//	 	 		  _AlarmPeriod= _AlarmPeriod - 1;
	 	 	//	 	 		 	  		if(_AlarmPeriod <=0)
	 	 	//	 	 		 	  		{
	 	 	//	 	 		 	  			_AlarmPeriod = 16;
	 	 	//	 	 		 	  		}
	 	 		 	 		   osMessageQueuePut(QueueCounterPumpHandle, &config , 0, osWaitForever);
	 	 		 	 	  }

	 	 	  	  	tick += (240 * osKernelGetTickFreq()) / 1000;
	 	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskAlarmCounter */
}

/* USER CODE BEGIN Header_StartTaskSdCard */
/**
* @brief Function implementing the TaskSdCard thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskSdCard */
void StartTaskSdCard(void *argument)
{
  /* USER CODE BEGIN StartTaskSdCard */

	FRESULT FatFsResult;
	FATFS SdFatFs;
	FIL SdCardFile;

	uint8_t bytes;
	char data[128];

	Data_Structure_t _Data_StructureGet = {0};
	Data_Structure_t *PointerDataZ = &_Data_StructureGet;

	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {



	  	  	 if (osOK == osMessageQueueGet(QueSDCARDHandle, PointerDataZ, 0, osWaitForever))
	  	  	 {


				  FatFsResult = f_mount(&SdFatFs, "", 1);
				  if(FatFsResult != FR_OK)
				  {
					  bytes = sprintf(data, "FatFS mount error.\n\r");
					  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
				  }

				  else
				  {
					  bytes = sprintf(data, "FatFS mounted.\n\r");
					  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);

					  //
					  // Open file on SD for writing
					  //

					  FatFsResult = f_open(&SdCardFile, "badania4.csv", FA_WRITE|FA_OPEN_APPEND);

					  //
					  // File open error check
					  //
					  if(FatFsResult != FR_OK)
					  {
						  bytes = sprintf(data, "No badaniam.csv file. Can't create.\n\r");
						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
					  }


					  else
					  {

						  bytes = sprintf(data, "File opened.\n\r");
						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);

						  //
						  //	Print something to this file
						  //
						  f_printf(&SdCardFile,PointerDataZ->MessageData);
						  f_printf(&SdCardFile,PointerDataZ->MessageTime);
						  f_printf(&SdCardFile,PointerDataZ->MessageTemp);
						  f_printf(&SdCardFile,PointerDataZ->MessageHum);
						  f_printf(&SdCardFile,PointerDataZ->MessageInten);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatVoltageBus);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatVoltageShunt);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatCurrent);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatPower);
						  f_printf(&SdCardFile,PointerDataZ->MessagePvVoltageBus);
						  f_printf(&SdCardFile,PointerDataZ->MessagePVVoltageShunt);
						  f_printf(&SdCardFile,PointerDataZ->MessagePVCurrent);
						  f_printf(&SdCardFile,PointerDataZ->MessagePVPower);

						  f_printf(&SdCardFile,PointerDataZ->MessageTimePump);
						  f_printf(&SdCardFile,PointerDataZ->MessageFreqAlarm);
						  f_printf(&SdCardFile,"\n");




			  //  		  for(uint8_t i = 0; i < 10; i++)
			  //  		  {
			  //  			  f_printf(&SdCardFile, "Line number %d;", i);
			  //  		  }

						  //
						  // Close file
						  //
						  FatFsResult = f_close(&SdCardFile);

						  bytes = sprintf(data, "File closed!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.\n\r");
						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);


						 //
								  // Open file on SD for reading
								  //
	//					  FatFsResult = f_open(&SdCardFile, "badaniaFreertos.csv", FA_READ);
	//					  if(FatFsResult != FR_OK)
	//				  {
	//						  bytes = sprintf(data, "No badaniaFreertos.csv file. Can't create.\n\r");
	//						HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
	//				  }
	//					else
	//						{
	//						UINT len;
	//
	//							do
	//							{
	//								len=0;
	//								f_read(&SdCardFile, data,10,&len);
	//								HAL_UART_Transmit(&huart2, (uint8_t*)data, len, 1000);
	//							} while (len >0);
	//
	//						  FatFsResult = f_close(&SdCardFile);
	//						  bytes = sprintf(data, "File closed.\n\r");
	//						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
	//						}




