Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
					  }
				  	  }


			  }



			tick += (10000 * osKernelGetTickFreq()) / 1000;
				  	 	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskSdCard */
}

/* USER CODE BEGIN Header_StartTaskINA219 */
/**
* @brief Function implementing the TaskINA219 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskINA219 */
void StartTaskINA219(void *argument)
{
  /* USER CODE BEGIN StartTaskINA219 */

	INA219_t ina219_2;
	ina219_calibration ina219_calibration;
	ina219_calibration.ina219_calibrationValue = 4096;
	ina219_calibration.ina219_currentDivider_mA = 10; // Current LSB = 100uA per bit (1000/100 = 10)
	ina219_calibration.ina219_powerMultiplier_mW = 2; // Power LSB = 1mW per bit (2/1)
//	ina219_calibration.ina219_calibrationValue = 8192;
//		ina219_calibration.ina219_currentDivider_mA = 20; // Current LSB = 100uA per bit (1000/100 = 10)
//		ina219_calibration.ina219_powerMultiplier_mW = 1.0f; // Power LSB = 1mW per bit (2/1)
	INA219Data_t _ina219;
	INA219Data_t *INA_219_pointer2 = &_ina219;





	 osMutexAcquire(MutexI2CHandle, osWaitForever);
	 INA219_Init(&ina219_2, &hi2c1, INA219_ADDRESS_BAT,&ina219_calibration);
	 INA219_setCalibration_32V_2A(&ina219_2,&ina219_calibration);

	 osMutexRelease(MutexI2CHandle);
	osTimerStart(TimerINA219BatHandle, 450);
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {


	  	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  	  printf("INA219 Mutex Acquire\n\r");
		  INA_219_pointer2->VoltageBus = INA219_ReadBusVoltage(&ina219_2);
		  INA_219_pointer2->VoltageShunt = INA219_ReadShuntVolage(&ina219_2);
		  INA_219_pointer2->Current =  INA219_ReadCurrent(&ina219_2);
		  INA_219_pointer2->Power = INA219_ReadPower(&ina219_2, &ina219_calibration);
		 //

//
		  osMutexRelease(MutexI2CHandle);
		  printf("INA219 Mutex Released\n\r");
//
		  if (osOK == osSemaphoreAcquire(BinarySemIna219BatHandle, 0)) {
		  	 	  			osMessageQueuePut(QuequeBatteryHandle, INA_219_pointer2, 0, osWaitForever);
		  	 	  		}
		  printf("INA219 exit \n\r");
//


	  tick+=(365*osKernelGetTickFreq())/1000;
	  osDelayUntil(tick);
  }
  /* USER CODE END StartTaskINA219 */
}

/* USER CODE BEGIN Header_StartTaskINA219PV */
/**
* @brief Function implementing the TaskINA219PV thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskINA219PV */
void StartTaskINA219PV(void *argument)
{
  /* USER CODE BEGIN StartTaskINA219PV */

	INA219_t ina219;
	ina219_calibration ina219_calibration2;
	ina219_calibration2.ina219_calibrationValue = 4096;
	ina219_calibration2.ina219_currentDivider_mA = 10; // Current LSB = 100uA per bit (1000/100 = 10)
	ina219_calibration2.ina219_powerMultiplier_mW = 2; // Power LSB = 1mW per bit (2/1)
//	ina219_calibration.ina219_calibrationValue = 8192;
//		ina219_calibration.ina219_currentDivider_mA = 20; // Current LSB = 100uA per bit (1000/100 = 10)
//		ina219_calibration.ina219_powerMultiplier_mW = 1.0f; // Power LSB = 1mW per bit (2/1)
	INA219Data_t _ina219_2;
	INA219Data_t *INA_219_pointer_2 = &_ina219_2;





	 osMutexAcquire(MutexI2CHandle, osWaitForever);
	 INA219_Init(&ina219, &hi2c1, INA219_ADDRESS_PV,&ina219_calibration2);
	 INA219_setCalibration_32V_2A(&ina219,&ina219_calibration2);

	 osMutexRelease(MutexI2CHandle);
	osTimerStart(TimerINA219Handle, 425);
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {

  	  osMutexAcquire(MutexI2CHandle, osWaitForever);
  	  printf("INA219 Mutex Acquire\n\r");
  	INA_219_pointer_2->VoltageBus = INA219_ReadBusVoltage(&ina219);
  	INA_219_pointer_2->VoltageShunt = INA219_ReadShuntVolage(&ina219);
  	INA_219_pointer_2->Current =  INA219_ReadCurrent(&ina219);
  	INA_219_pointer_2->Power = INA219_ReadPower(&ina219, &ina219_calibration2);
	 //

//
	  osMutexRelease(MutexI2CHandle);
	  printf("INA219 Mutex Released\n\r");
//
	  if (osOK == osSemaphoreAcquire(BinarySemINA219Handle, 0)) {
	  	 	  			osMessageQueuePut(QueuePVHandle, INA_219_pointer_2, 0, osWaitForever);
	  	 	  		}
	  printf("INA219 exit \n\r");
//

	  tick+=(325*osKernelGetTickFreq())/1000;
	  osDelayUntil(tick);
  }
  /* USER CODE END StartTaskINA219PV */
}

/* USER CODE BEGIN Header_StartTaskDS3231 */
/**
* @brief Function implementing the TaskDS3231 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskDS3231 */
void StartTaskDS3231(void *argument)
{
  /* USER CODE BEGIN StartTaskDS3231 */

			Ds3231_t _Ds3231;

			RTC_TimeTypeDef _RTCTime1 = {0};
			RTC_DateTypeDef _RTCDate1 = {0};



			DS3231_Init(&hi2c1);
	//	  DS3231_SetRateSelect(DS3231_1HZ);



  /* Infinite loop */
  for(;;)
  {
	  	  	  osThreadFlagsWait(0x00000100U, osFlagsWaitAll, osWaitForever);

	 	  	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	 	  	 _RTCDate1.Year = DS3231_GetYear() -2000;
	 		 _RTCDate1.Month = DS3231_GetMonth();
	 		 _RTCDate1.Date = DS3231_GetDate();

	 	  	  _RTCTime1.Hours = DS3231_GetHour();
	 	  	  _RTCTime1.Minutes = DS3231_GetMinute();
	 	  	  _RTCTime1.Seconds =  DS3231_GetSecond();



	 		  osMutexRelease(MutexI2CHandle);


	 		  osMessageQueuePut(QueDs3231TimeHandle, &_RTCTime1, 0, osWaitForever);
	 		  osMessageQueuePut(QueueDs3231DateHandle, &_RTCDate1, 0, osWaitForever);

	 		  printf(" Date: %d: %d: %d\n\r", _RTCDate1.Year, _RTCDate1.Month, _RTCDate1.Date );
	 		  printf(" time: %d: %d: %d\n\r", _RTCTime1.Hours, _RTCTime1.Minutes, _RTCTime1.Seconds );
	 //		  osThreadFlagsClear(0x00000100U);
	 		  osThreadFlagsClear(0x00000100U);
  }
  /* USER CODE END StartTaskDS3231 */
}

/* CallbackTimerBmeData function */
void CallbackTimerBmeData(void *argument)
{
  /* USER CODE BEGIN CallbackTimerBmeData */
	osSemaphoreRelease(BinarySemBme280Handle);
  /* USER CODE END CallbackTimerBmeData */
}

/* CallbackTimerBh1750Data function */
void CallbackTimerBh1750Data(void *argument)
{
  /* USER CODE BEGIN CallbackTimerBh1750Data */
	osSemaphoreRelease(BinarySemBH1750Handle);
  /* USER CODE END CallbackTimerBh1750Data */
}

/* CallbackTimerRTC function */
void CallbackTimerRTC(void *argument)
{
  /* USER CODE BEGIN CallbackTimerRTC */
	osSemaphoreRelease(BinarySemRTCHandle);
  /* USER CODE END CallbackTimerRTC */
}

/* CallbackTimerSDCard function */
void CallbackTimerSDCard(void *argument)
{
  /* USER CODE BEGIN CallbackTimerSDCard */
	osSemaphoreRelease(BinarySdCardHandle);
  /* USER CODE END CallbackTimerSDCard */
}

/* CallbackTimerINA219 function */
void CallbackTimerINA219(void *argument)
{
  /* USER CODE BEGIN CallbackTimerINA219 */
	osSemaphoreRelease(BinarySemINA219Handle);
  /* USER CODE END CallbackTimerINA219 */
}

/* CallbackTimerINA219Bat function */
void CallbackTimerINA219Bat(void *argument)
{
  /* USER CODE BEGIN CallbackTimerINA219Bat */
	osSemaphoreRelease(BinarySemIna219BatHandle);
  /* USER CODE END CallbackTimerINA219Bat */
}

/* Private application code --------------------------------------------------*/
/* USER CODE BEGIN Application */

//void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
//{
//	static uint8_t _PumpDipensing = 1;
//
//
//
//	if(GPIO_Pin == B1_Pin)
//	{
//
//		_PumpDipensing= _PumpDipensing + 1;
//		if(_PumpDipensing >=60)
//		{
//			_PumpDipensing = 1;
//		}
//		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 0);
//
//
//
////		osThreadFlagsSet(TaskAlarmCountUHandle, 0x00010000U);
//
//	}
//
//}
//void Parse(void)
//{
//	uint8_t i,j;
//	float EnvParameters[5];
//	char Message[200];
//
//	for ( i = 0; i < 5; i++)
//	{
//		char *ParsePointer = strtok(NULL,",");
//	}
//}

void _putchar(char character)
{
	// send char to console etc.
	osMutexAcquire(MutexPrintfHandle, osWaitForever);
	HAL_UART_Transmit(&huart2, (uint8_t*)&character, 1, 1000);

	osMutexRelease(MutexPrintfHandle);
}


/* USER CODE END Application */

